vvod= int(input("Здравствуйте!Введите значение первого элемента геометрической прогрессии:")) #вводим значение первого элемента ГП
znam=  int(input("Введите множитель прогрессии:")) #вводим множитель ГП
pos=  int(input("Введите номер последнего элемента:")) #вводим номер последнего элемента
if -10_000 <= vvod <= 10_000 and 1 <= znam <= 50 and 2 <= pos <= 100: #задаем ограничения входных данных
  if znam == 1: #если знаменатель равен 1
    summa = vvod * pos #значение при знаменателе равном одному
  else: summa = vvod * (znam**pos - 1) // (znam - 1) #если входит в диапазон,то считаем сумму по формуле 
  print (f"Сумма {pos} членов геометрической прогрессии: {summa}") #вывыводим сумму
else: # ...то
    print("Не входит в диапазон") #если не входит в диапазон,то выводим "Не входит в диапазон"