n = int(input("Здравствуйте!Введите ваше число , и узнайте,простое оно или составное.Если оно будет простым,вы увидите на экране Y, а если составным,то N:")) #вводим значение
if 1 <= n <= 25: #задаем ограничения
    if n < 2: #если меньше 2
        print("N") #вывести "N"
    else: #...то
        is_prostoe = True #переменная и присваивается true
        for i in range(2, int(n ** 0.5) + 1): #проверяем делители до корня из n
            if n % i == 0: #если n делится на i без остатка
                is_prostoe = False #число составное
                break #остановить цикл
        if is_prostoe: #если простое
            print("Y") #вывод значения Y(составное)
        else:#...то
            print("N")#выводим то , что составное
else:#...то
    print("Не входит в диапазон") #вывод того , что не входит в диапазон